Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.4.118/edc/PIC32MZ1025DAH176.PIC
      <edc:SFRDef edc:_addr="0x1F860850" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="9" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CNPUJ" edc:desc="" edc:grp="PORTJ" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="CNPUJ" edc:nzwidth="0x20" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTJ">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPUJ0" edc:desc="" edc:mask="0x1" edc:name="CNPUJ0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUJ1" edc:desc="" edc:mask="0x1" edc:name="CNPUJ1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUJ2" edc:desc="" edc:mask="0x1" edc:name="CNPUJ2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUJ3" edc:desc="" edc:mask="0x1" edc:name="CNPUJ3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUJ4" edc:desc="" edc:mask="0x1" edc:name="CNPUJ4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUJ5" edc:desc="" edc:mask="0x1" edc:name="CNPUJ5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUJ6" edc:desc="" edc:mask="0x1" edc:name="CNPUJ6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUJ7" edc:desc="" edc:mask="0x1" edc:name="CNPUJ7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUJ8" edc:desc="" edc:mask="0x1" edc:name="CNPUJ8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUJ9" edc:desc="" edc:mask="0x1" edc:name="CNPUJ9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUJ10" edc:desc="" edc:mask="0x1" edc:name="CNPUJ10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUJ11" edc:desc="" edc:mask="0x1" edc:name="CNPUJ11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUJ12" edc:desc="" edc:mask="0x1" edc:name="CNPUJ12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUJ13" edc:desc="" edc:mask="0x1" edc:name="CNPUJ13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUJ14" edc:desc="" edc:mask="0x1" edc:name="CNPUJ14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUJ15" edc:desc="" edc:mask="0x1" edc:name="CNPUJ15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860860" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="9" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CNPDJ" edc:desc="" edc:grp="PORTJ" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="CNPDJ" edc:nzwidth="0x20" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTJ">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPDJ0" edc:desc="" edc:mask="0x1" edc:name="CNPDJ0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDJ1" edc:desc="" edc:mask="0x1" edc:name="CNPDJ1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDJ2" edc:desc="" edc:mask="0x1" edc:name="CNPDJ2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDJ3" edc:desc="" edc:mask="0x1" edc:name="CNPDJ3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDJ4" edc:desc="" edc:mask="0x1" edc:name="CNPDJ4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDJ5" edc:desc="" edc:mask="0x1" edc:name="CNPDJ5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDJ6" edc:desc="" edc:mask="0x1" edc:name="CNPDJ6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDJ7" edc:desc="" edc:mask="0x1" edc:name="CNPDJ7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDJ8" edc:desc="" edc:mask="0x1" edc:name="CNPDJ8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDJ9" edc:desc="" edc:mask="0x1" edc:name="CNPDJ9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDJ10" edc:desc="" edc:mask="0x1" edc:name="CNPDJ10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDJ11" edc:desc="" edc:mask="0x1" edc:name="CNPDJ11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDJ12" edc:desc="" edc:mask="0x1" edc:name="CNPDJ12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDJ13" edc:desc="" edc:mask="0x1" edc:name="CNPDJ13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDJ14" edc:desc="" edc:mask="0x1" edc:name="CNPDJ14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDJ15" edc:desc="" edc:mask="0x1" edc:name="CNPDJ15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860870" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="9" edc:access="----------------n---n-----------" edc:cname="CNCONJ" edc:desc="" edc:grp="PORTJ" edc:impl="0xffff9fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0---0-----------" edc:name="CNCONJ" edc:nzwidth="0x20" edc:por="----------------0---0-----------" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTJ">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0xb"/>
            <edc:SFRFieldDef edc:cname="EDGEDETECT" edc:mask="0x1" edc:name="EDGEDETECT" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="CHANGE NOTICE J" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860880" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="9" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CNENJ" edc:desc="" edc:grp="PORTJ" edc:impl="0xffc0ffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="CNENJ" edc:nzwidth="0x20" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTJ">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNIEJ0" edc:desc="" edc:mask="0x1" edc:name="CNIEJ0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEJ1" edc:desc="" edc:mask="0x1" edc:name="CNIEJ1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEJ2" edc:desc="" edc:mask="0x1" edc:name="CNIEJ2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEJ3" edc:desc="" edc:mask="0x1" edc:name="CNIEJ3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEJ4" edc:desc="" edc:mask="0x1" edc:name="CNIEJ4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEJ5" edc:desc="" edc:mask="0x1" edc:name="CNIEJ5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEJ6" edc:desc="" edc:mask="0x1" edc:name="CNIEJ6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEJ7" edc:desc="" edc:mask="0x1" edc:name="CNIEJ7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEJ8" edc:desc="" edc:mask="0x1" edc:name="CNIEJ8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEJ9" edc:desc="" edc:mask="0x1" edc:name="CNIEJ9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEJ10" edc:desc="" edc:mask="0x1" edc:name="CNIEJ10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEJ11" edc:desc="" edc:mask="0x1" edc:name="CNIEJ11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEJ12" edc:desc="" edc:mask="0x1" edc:name="CNIEJ12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEJ13" edc:desc="" edc:mask="0x1" edc:name="CNIEJ13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEJ14" edc:desc="" edc:mask="0x1" edc:name="CNIEJ14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEJ15" edc:desc="" edc:mask="0x1" edc:name="CNIEJ15" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860890" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="9" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CNSTATJ" edc:desc="" edc:grp="PORTJ" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="CNSTATJ" edc:nzwidth="0x20" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTJ">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNSTATJ0" edc:desc="" edc:mask="0x1" edc:name="CNSTATJ0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATJ1" edc:desc="" edc:mask="0x1" edc:name="CNSTATJ1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATJ2" edc:desc="" edc:mask="0x1" edc:name="CNSTATJ2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATJ3" edc:desc="" edc:mask="0x1" edc:name="CNSTATJ3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATJ4" edc:desc="" edc:mask="0x1" edc:name="CNSTATJ4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATJ5" edc:desc="" edc:mask="0x1" edc:name="CNSTATJ5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATJ6" edc:desc="" edc:mask="0x1" edc:name="CNSTATJ6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATJ7" edc:desc="" edc:mask="0x1" edc:name="CNSTATJ7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATJ8" edc:desc="" edc:mask="0x1" edc:name="CNSTATJ8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATJ9" edc:desc="" edc:mask="0x1" edc:name="CNSTATJ9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATJ10" edc:desc="" edc:mask="0x1" edc:name="CNSTATJ10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATJ11" edc:desc="" edc:mask="0x1" edc:name="CNSTATJ11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATJ12" edc:desc="" edc:mask="0x1" edc:name="CNSTATJ12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATJ13" edc:desc="" edc:mask="0x1" edc:name="CNSTATJ13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATJ14" edc:desc="" edc:mask="0x1" edc:name="CNSTATJ14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATJ15" edc:desc="" edc:mask="0x1" edc:name="CNSTATJ15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8608A0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="9" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CNNEJ" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="CNNEJ" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTJ">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNNEJ0" edc:mask="0x1" edc:name="CNNEJ0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEJ1" edc:mask="0x1" edc:name="CNNEJ1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEJ2" edc:mask="0x1" edc:name="CNNEJ2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEJ3" edc:mask="0x1" edc:name="CNNEJ3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEJ4" edc:mask="0x1" edc:name="CNNEJ4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEJ5" edc:mask="0x1" edc:name="CNNEJ5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEJ6" edc:mask="0x1" edc:name="CNNEJ6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEJ7" edc:mask="0x1" edc:name="CNNEJ7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEJ8" edc:mask="0x1" edc:name="CNNEJ8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEJ9" edc:mask="0x1" edc:name="CNNEJ9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEJ10" edc:mask="0x1" edc:name="CNNEJ10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEJ11" edc:mask="0x1" edc:name="CNNEJ11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEJ12" edc:mask="0x1" edc:name="CNNEJ12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEJ13" edc:mask="0x1" edc:name="CNNEJ13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEJ14" edc:mask="0x1" edc:name="CNNEJ14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEJ15" edc:mask="0x1" edc:name="CNNEJ15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
