Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.4.118/edc/PIC32MZ1025DAH176.PIC
      <edc:SFRDef edc:_addr="0x1F8E601C" edc:_begin="0x0" edc:_end="0x24" edc:_modsrc="DOS-EIP-00218_math_rng_ahbs_v2.Module" edc:_refcount="1" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="RNGSEED2" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="RNGSEED2" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="RNG">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SEED" edc:desc="" edc:mask="0xffffffff" edc:name="SEED" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E6020" edc:_begin="0x0" edc:_end="0x24" edc:_modsrc="DOS-EIP-00218_math_rng_ahbs_v2.Module" edc:_refcount="1" edc:access="-------------------------nnnnnnn" edc:cname="RNGCNT" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------------0000000" edc:name="RNGCNT" edc:nzwidth="32" edc:por="-------------------------0000000" ltx:memberofperipheral="RNG">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RCNT" edc:desc="" edc:mask="0x7f" edc:name="RCNT" edc:nzwidth="7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8E6024" edc:offset="0x1FDC"/>
      <edc:SFRDef edc:_addr="0x1F8E8000" edc:_begin="0x0" edc:_end="0x54" edc:_modsrc="DOS-EIP-00184_emb_ddr_controller_v1.Module" edc:_refcount="1" edc:access="------------------------nnnnnnnn" edc:cname="DDRTSEL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------00000000" edc:name="DDRTSEL" edc:nzwidth="32" edc:por="------------------------00000000" ltx:baseofperipheral="DDR">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TSEL" edc:desc="" edc:mask="0xff" edc:name="TSEL" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E8004" edc:_begin="0x0" edc:_end="0x54" edc:_modsrc="DOS-EIP-00184_emb_ddr_controller_v1.Module" edc:_refcount="1" edc:access="---------------------------nnnnn" edc:cname="DDRMINLIM" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="DDRMINLIM" edc:nzwidth="32" edc:por="---------------------------00000" ltx:memberofperipheral="DDR">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MINLIMIT" edc:desc="" edc:mask="0x1f" edc:name="TSEL" edc:nzwidth="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E8008" edc:_begin="0x0" edc:_end="0x54" edc:_modsrc="DOS-EIP-00184_emb_ddr_controller_v1.Module" edc:_refcount="1" edc:access="------------------------nnnnnnnn" edc:cname="DDRRQPER" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------00000000" edc:name="DDRRQPER" edc:nzwidth="32" edc:por="------------------------00000000" ltx:memberofperipheral="DDR">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RQPER" edc:desc="" edc:mask="0xff" edc:name="RQPER" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E800C" edc:_begin="0x0" edc:_end="0x54" edc:_modsrc="DOS-EIP-00184_emb_ddr_controller_v1.Module" edc:_refcount="1" edc:access="------------------------nnnnnnnn" edc:cname="DDRMINCMD" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------00000000" edc:name="DDRMINCMD" edc:nzwidth="32" edc:por="------------------------00000000" ltx:memberofperipheral="DDR">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MINCMD" edc:desc="" edc:mask="0xff" edc:name="MINCMD" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E8010" edc:_begin="0x0" edc:_end="0x54" edc:_modsrc="DOS-EIP-00184_emb_ddr_controller_v1.Module" edc:_refcount="1" edc:access="------------------------------nn" edc:cname="DDRMEMCON" edc:desc="" edc:impl="0x3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------------00" edc:name="DDRMEMCON" edc:nzwidth="32" edc:por="------------------------------00" ltx:memberofperipheral="DDR">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="STINIT" edc:desc="" edc:mask="0x1" edc:name="STINIT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INITDN" edc:desc="" edc:mask="0x1" edc:name="INITDN" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E8014" edc:_begin="0x0" edc:_end="0x54" edc:_modsrc="DOS-EIP-00184_emb_ddr_controller_v1.Module" edc:_refcount="1" edc:access="-n-nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="DDRMEMCFG0" edc:desc="" edc:impl="0x5f1f1f1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0-00000---00000---00000---00000" edc:name="DDRMEMCFG0" edc:nzwidth="32" edc:por="-0-00000---00000---00000---00000" ltx:memberofperipheral="DDR">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RWADDR" edc:desc="" edc:mask="0x1f" edc:name="RWADDR" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="BNKADDR" edc:desc="" edc:mask="0x1f" edc:name="BNKADDR" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="CSADDR" edc:desc="" edc:mask="0x1f" edc:name="CSADDR" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="CLHADDR" edc:desc="" edc:mask="0x1f" edc:name="CLHADDR" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="APCHRGEN" edc:desc="" edc:mask="0x1" edc:name="APCHRGEN" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E8018" edc:_begin="0x0" edc:_end="0x54" edc:_modsrc="DOS-EIP-00184_emb_ddr_controller_v1.Module" edc:_refcount="1" edc:access="-------------------nnnnnnnnnnnnn" edc:cname="DDRMEMCFG1" edc:desc="" edc:impl="0x1fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------0000000000000" edc:name="DDRMEMCFG1" edc:nzwidth="32" edc:por="-------------------0000000000000" ltx:memberofperipheral="DDR">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RWADDRMSK" edc:desc="" edc:mask="0x1fff" edc:name="RWADDRMSK" edc:nzwidth="13"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E801C" edc:_begin="0x0" edc:_end="0x54" edc:_modsrc="DOS-EIP-00184_emb_ddr_controller_v1.Module" edc:_refcount="1" edc:access="-------------------nnnnnnnnnnnnn" edc:cname="DDRMEMCFG2" edc:desc="" edc:impl="0x1fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------0000000000000" edc:name="DDRMEMCFG2" edc:nzwidth="32" edc:por="-------------------0000000000000" ltx:memberofperipheral="DDR">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CLADDRHMSK" edc:desc="" edc:mask="0x1fff" edc:name="CLADDRHMSK" edc:nzwidth="13"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E8020" edc:_begin="0x0" edc:_end="0x54" edc:_modsrc="DOS-EIP-00184_emb_ddr_controller_v1.Module" edc:_refcount="1" edc:access="-------------------nnnnnnnnnnnnn" edc:cname="DDRMEMCFG3" edc:desc="" edc:impl="0x1fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------0000000000000" edc:name="DDRMEMCFG3" edc:nzwidth="32" edc:por="-------------------0000000000000" ltx:memberofperipheral="DDR">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CLADDRLMSK" edc:desc="" edc:mask="0x1fff" edc:name="CLADDRLMSK" edc:nzwidth="13"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E8024" edc:_begin="0x0" edc:_end="0x54" edc:_modsrc="DOS-EIP-00184_emb_ddr_controller_v1.Module" edc:_refcount="1" edc:access="-------------------nnnnn---nnnnn" edc:cname="DDRMEMCFG4" edc:desc="" edc:impl="0xf81f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------00000---00000" edc:name="DDRMEMCFG4" edc:nzwidth="32" edc:por="-------------------00000---00000" ltx:memberofperipheral="DDR">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BNKADDRMSK" edc:desc="" edc:mask="0x1f" edc:name="BNKADDRMSK" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="CSADDRMSK" edc:desc="" edc:mask="0x1f" edc:name="CSADDRMSK" edc:nzwidth="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E8028" edc:_begin="0x0" edc:_end="0x54" edc:_modsrc="DOS-EIP-00184_emb_ddr_controller_v1.Module" edc:_refcount="1" edc:access="----nnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DDRREFCFG" edc:desc="" edc:impl="0xfffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000000000000000000000000000" edc:name="DDRREFCFG" edc:nzwidth="32" edc:por="----0000000000000000000000000000" ltx:memberofperipheral="DDR">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="REFCNT" edc:desc="" edc:mask="0xffff" edc:name="REFCNT" edc:nzwidth="16"/>
            <edc:SFRFieldDef edc:cname="REFDLY" edc:desc="" edc:mask="0xff" edc:name="REFDLY" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="MAXREFS" edc:desc="" edc:mask="0x7" edc:name="MAXREFS" edc:nzwidth="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E802C" edc:_begin="0x0" edc:_end="0x54" edc:_modsrc="DOS-EIP-00184_emb_ddr_controller_v1.Module" edc:_refcount="1" edc:access="---------nnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DDRPWRCFG" edc:desc="" edc:impl="0x7fffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------00000000000000000000000" edc:name="DDRPWRCFG" edc:nzwidth="32" edc:por="---------00000000000000000000000" ltx:memberofperipheral="DDR">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="APWRDNEN" edc:desc="" edc:mask="0x1" edc:name="APWRDNEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ASLFREFEN" edc:desc="" edc:mask="0x1" edc:name="ASLFREFEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PWRDNDLY" edc:desc="" edc:mask="0xff" edc:name="PWRDNDLY" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="SLFREFDLY" edc:desc="" edc:mask="0x3ff" edc:name="SLFREFDLY" edc:nzwidth="10"/>
            <edc:SFRFieldDef edc:cname="PCHRGPWRDN" edc:desc="" edc:mask="0x1" edc:name="PCHRGPWRDN" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
